{
  "Sections" : [
    {
      "title" : "Welcome",
      "content" : "<p>I am a self taught, self motivated mid-30s web developer with over 10 years experience.</p><p>I have helped dozens of companies and organisations bring websites and web applications from concept to publish.</p><p>I am comfortable with AND enjoy working on all areas of the stack.</p><p>I am good with: <br /><b>PHP</b> (including WordPress & Laravel), <br /><b>JavaScript</b> (including React + Redux, Node.js & task runners, webpack etc...), <br /><b>Python</b> (including Django & Wagtail), <br /><b>MySQL or NoSQL</b>, <br /><b>Linux</b> (System Administration and maintenance),<br />...and others</p>"
    },
    {
      "title" : "What I've been doing",
      "content" : "<p>For a little over 10 years I have been running a small business that has been developing, supporting and hosting websites and apps for various companies and organisations.</p><p>As I was pretty much the only developer I had to adapt to differing needs. Sometimes I would be working with PHP, WordPress and MySQL and another time I may be working with Python, Django and PostgreSQL.</p><p>In addition to this I would also set up hosting environments. Some would need to support heavy traffic but with minimal processing and others the other way around so I've become quite good at calculating the potential resource usage for apps based on their uses and functionality.</p><p>Being involved on the server-side has also improved my development over the years since I understand how processes consume resources and write efficient code to mitigate future problems.</p><p>I always worked closely with our clients and I understand their side; this has resulted in me becoming a good communicator.</p>"
    },
    {
      "title" : "What I want to do",
      "content" : "<p>Although I am comfortable working on all of the stack I do not excel in any one area. I would be best suited to a company looking for an all-rounder although I would be happy to focus on one area.</p><p>I want to be part of a team of professionals and enthusiasts just like myself and aim to become the best I can at my craft. I also like to help make clients happy so working in a creative / digital agency would fulfil that.</p>"
    },
    {
      "title" : "About my skills",
      "content" : "<p>Although I am self taught, I have used online study material and taken deep dives into the technology that I use.<p>I have a deep understanding of core JavaScript and PHP, I've been using WordPress a lot in my role, and a good understanding of React + Redux, Express, Laravel, MySQL / NoSQL.</p><p>I am also pretty good with vanilla Python and Django.</p><p>I am constantly exploring technology and how I can improve my skills to become more useful.</p>"
    },
    {
      "title" : "Some personal stuff",
      "content" : "<p>When I'm not writing code I am an occasional marathon runner and train for such events. This year I have attempted 2 ultra marathons, the first I had to end at 26 miles due to a knee injury and the second I succeeded in finishing. I also enjoy participating in and watching boxing and hiking when the weather is too hot to run.</p><p>I also have an interest in cooking (and eating!) healthy food and enjoy a nice craft lager fairly regularly.</p>"
    },
    {
      "title" : "Contact details",
      "content" : "<p>Please contact me via e-mail or LinkedIn</p><p>Email: <b>joe@white-fire.co.uk</b></p><p>LinkedIn: <b><a href=\"https://www.linkedin.com/in/joebuckle1/\" target=\"_blank\">https://www.linkedin.com/in/joebuckle1/</a></b></p>"
    }
  ],
  "Breakout": {
    "hallOfFame": [
      {
        "name" : "Joe Buckle",
        "score" : 100
      },
      {
        "name" : "Joe Buckle",
        "score" : 90
      },
      {
        "name" : "Joe Buckle",
        "score" : 80
      },
      {
        "name" : "Joe Buckle",
        "score" : 70
      },
      {
        "name" : "Joe Buckle",
        "score" : 60
      },
      {
        "name" : "Joe Buckle",
        "score" : 50
      },
      {
        "name" : "Joe Buckle",
        "score" : 40
      },
      {
        "name" : "Joe Buckle",
        "score" : 30
      },
      {
        "name" : "Joe Buckle",
        "score" : 20
      },
      {
        "name" : "Joe Buckle",
        "score" : 10
      }
    ]
  }
}